000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ШаблоныРегистрацииНовыхКарт/ШаблоныРегистрацииНовыхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШаблоныРегистрацииНовыхКарт</name>
  <resources>
    <name>ПроводитьОпросВладельцаПриРегистрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидДисконтнойКарты</name>
    <type>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаКарты</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </resources>
  <resources>
    <name>НаименованиеШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидКарты</name>
    <type>
      <types>EnumRef.ВидыИнформационныхКарт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДлинаКода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НачалоДиапазона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>99</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КонецДиапазона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>99</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ШаблоныРегистрацииНовыхКарт/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПроверитьПересеченияСервер()
	
	ТекстСообщения = НСтр("ru = 'Пересечения не обнаружены'"); 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ВидКарты,
	|	ВложенныйЗапрос.ДлинаКода,
	|	ВложенныйЗапрос.НачалоДиапазона,
	|	ВложенныйЗапрос.КонецДиапазона,
	|	ВложенныйЗапрос.ПроводитьОпросВладельцаПриРегистрации,
	|	ВложенныйЗапрос.ВидДисконтнойКарты,
	|	ВложенныйЗапрос.ГруппаКарты,
	|	ВложенныйЗапрос.НаименованиеШаблона
	|ИЗ
	|	(ВЫБРАТЬ
	|		ШаблоныРегистрацииНовыхКарт.ВидКарты КАК ВидКарты,
	|		ШаблоныРегистрацииНовыхКарт.ДлинаКода КАК ДлинаКода,
	|		ШаблоныРегистрацииНовыхКарт.НачалоДиапазона КАК НачалоДиапазона,
	|		ШаблоныРегистрацииНовыхКарт.КонецДиапазона КАК КонецДиапазона,
	|		ШаблоныРегистрацииНовыхКарт.ПроводитьОпросВладельцаПриРегистрации КАК ПроводитьОпросВладельцаПриРегистрации,
	|		ШаблоныРегистрацииНовыхКарт.ВидДисконтнойКарты КАК ВидДисконтнойКарты,
	|		ШаблоныРегистрацииНовыхКарт.ГруппаКарты КАК ГруппаКарты,
	|		ВЫБОР
	|			КОГДА ШаблоныРегистрацииНовыхКарт.НачалоДиапазона < &НачалоДиапазона
	|					И ШаблоныРегистрацииНовыхКарт.КонецДиапазона < &НачалоДиапазона
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ШаблоныРегистрацииНовыхКарт.НачалоДиапазона > &КонецДиапазона
	|							И ШаблоныРегистрацииНовыхКарт.КонецДиапазона > &КонецДиапазона
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		КОНЕЦ КАК Пересечение,
	|		ШаблоныРегистрацииНовыхКарт.НаименованиеШаблона КАК НаименованиеШаблона
	|	ИЗ
	|		РегистрСведений.ШаблоныРегистрацииНовыхКарт КАК ШаблоныРегистрацииНовыхКарт
	|	ГДЕ
	|		ШаблоныРегистрацииНовыхКарт.ДлинаКода = &ДлинаКода
	|		И (НЕ(ШаблоныРегистрацииНовыхКарт.НачалоДиапазона = &НачалоДиапазона
	|					И ШаблоныРегистрацииНовыхКарт.КонецДиапазона = &КонецДиапазона))
	|		И ШаблоныРегистрацииНовыхКарт.ВидКарты = &ВидКарты) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.Пересечение";
	
	Запрос.УстановитьПараметр("ДлинаКода"      , Запись.ДлинаКода);
	Запрос.УстановитьПараметр("НачалоДиапазона", Запись.НачалоДиапазона);
	Запрос.УстановитьПараметр("КонецДиапазона" , Запись.КонецДиапазона);
	Запрос.УстановитьПараметр("ВидКарты"       , Запись.ВидКарты);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		
		ТекстСообщения = НСтр("ru = 'Диапазон текущей записи пересекается с диапазоном (-ами)'");
		Пока Выборка.Следующий() Цикл
			ТекстШаблона = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '  %1 Начало даипазона - %2 Конец диапазона - %3'"),
				Выборка.НаименованиеШаблона,
				Выборка.НачалоДиапазона,
				Выборка.КонецДиапазона
			);
			
			ТекстСообщения = ТекстСообщения + Символы.ПС + ТекстШаблона;
		КонецЦикла;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстСообщения,
		Запись,
		"НачалоДиапазона"
	);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПересечения(Команда)
	
	ПроверитьПересеченияСервер();
	
КонецПроцедуры
